1. markdown cell for documentation purpose
2. code cell  for python logic

Syntax for markdown

# this is my heading
## heading 2
### heading 3

we are **learning** machine learning

[google](https://www.google.com)

[google](https://www.google.com)

![logo](https://static.scientificamerican.com/sciam/cache/file/4E0744CD-793A-4EF8-B550B54F7F2C4406_source.jpg?w=590&h=800&ACB6A419-81EB-4B9C-B846FD8EBFB16FBE)

ordered list of items
1. Android
2. Mac
3. Windows
4. Firefox

un-ordered items

* Coffee
* Tea
* Milk

#### shortcuts in Jupyter notebook

**esc m**

it can change current cell into markdown cell

**esc y**

it can change current cell into code cell

**esc d d**

to delete current cell

**esc a**

to create cell above the current cell

**esc b**

to create cell below the current cell

**shift enter**


to run the current cell

**esc z**

to undo deleted cell

**csv manipulations using panday**

**How to read the csv?**

In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('Employee.csv')

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df

   Experience Salary
0           1  10000
1           2  11000
2           3  15000
3           4  18000
4           5    NaN
5           6   ramu
6           7  25000

**To display top 5 rows**

In [8]:
df.head()

   Experience Salary
0           1  10000
1           2  11000
2           3  15000
3           4  18000
4           5    NaN

**to display top required(3) rows**

In [9]:
df.head(3)

   Experience Salary
0           1  10000
1           2  11000
2           3  15000

**to display bottom 5 rows**

In [10]:
df.tail()

   Experience Salary
2           3  15000
3           4  18000
4           5    NaN
5           6   ramu
6           7  25000

**to display bottom required rows**

In [11]:
df.tail(3)

   Experience Salary
4           5    NaN
5           6   ramu
6           7  25000

**is there any missing values?**

In [12]:
df.isna()

   Experience  Salary
0       False   False
1       False   False
2       False   False
3       False   False
4       False    True
5       False   False
6       False   False

In [13]:
df.isna().sum()

Experience    0
Salary        1
dtype: int64

**how to manipulate this missing value**

In [14]:
df

   Experience Salary
0           1  10000
1           2  11000
2           3  15000
3           4  18000
4           5    NaN
5           6   ramu
6           7  25000

In [15]:
df.fillna(30000)

   Experience Salary
0           1  10000
1           2  11000
2           3  15000
3           4  18000
4           5  30000
5           6   ramu
6           7  25000

**is there any invalid values**

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
Experience    7 non-null int64
Salary        6 non-null object
dtypes: int64(1), object(1)
memory usage: 124.0+ bytes

In [32]:
df.drop(df.index[[5]])

   Experience Salary
0           1  10000
1           2  11000
2           3  15000
3           4  18000
4           5    NaN
6           7  25000

In [34]:
df.shape

(7, 2)

In [36]:
df.fillna(1000)

   Experience Salary
0           1  10000
1           2  11000
2           3  15000
3           4  18000
4           5   1000
5           6   ramu
6           7  25000

In [37]:
df = df.drop(df.index[[5]])
df

   Experience Salary
0           1  10000
1           2  11000
2           3  15000
3           4  18000
4           5    NaN
6           7  25000

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 6
Data columns (total 2 columns):
Experience    6 non-null int64
Salary        5 non-null object
dtypes: int64(1), object(1)
memory usage: 120.0+ bytes

In [43]:
df['Salary'] = df['Salary'].astype(float)

In [45]:
mean = df.Salary.mean()

In [46]:
df.fillna(mean)

   Experience   Salary
0           1  10000.0
1           2  11000.0
2           3  15000.0
3           4  18000.0
4           5  15800.0
6           7  25000.0

In [49]:
df.sort_values('Salary')

   Experience   Salary
0           1  10000.0
1           2  11000.0
2           3  15000.0
3           4  18000.0
6           7  25000.0
4           5      NaN